# Git
brew "git"
brew "git-now"
brew "ghq"
brew "git-split-diffs"

# Fish
brew "fish"
brew "fzf"
brew "bat"
brew "fd"
brew "zoxide"

# Dev
brew "mise"
brew "tmux"
brew "lazydocker"
brew "direnv"
brew "navi"
brew "gh"
brew "yazi"
brew "eza"
brew "mysql-client"
brew "libpq"
brew "doggo"
brew "satococoa/tap/wtp"
brew "gcc"
brew "neovim"
brew "lazygit"
brew "ripgrep"
tap "laishulu/homebrew"
brew "macism"
cask "jetbrains-toolbox"

# AWS
brew "awscli"
brew "yukiarrr/tap/ecsk"
cask "session-manager-plugin"
cask "aws-vault-binary"

# Font
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-udev-gothic-nf"

# IME
tap "daipeihust/tap"
brew "im-select"
cask "google-japanese-ime"

# Browser
cask "thebrowsercompany-dia"

# UI
tap "FelixKratz/formulae"
brew "sketchybar"

# App - Essential
cask "orbstack"
cask "espanso"
cask "cmd-eikana"
cask "bitwarden"
cask "raycast"

# App - Work
cask "slack"
cask "notion"
cask "notion-calendar"
cask "discord"

# App - Dev
cask "wezterm"
cask "obsidian"
cask "cursor"
cask "visual-studio-code@insiders"

# App - AI
cask "chatgpt"
cask "claude"

# App - Other
cask "zoom"
cask "spotify"
