# Git
tap "sho918/git-ws", "https://github.com/sho918/git-ws"
brew "git"
brew "git-now"
brew "ghq"
brew "git-split-diffs"
brew "sho918/git-ws/git-ws"

# Fish
brew "fish"
brew "fzf"
brew "bat"
brew "fd"
brew "zoxide"

# Dev
brew "jq"
brew "yq"
brew "mise"
brew "tmux"
brew "lazydocker"
brew "direnv"
brew "navi"
brew "gh"
brew "yazi"
brew "eza"
brew "mysql-client"
brew "libpq"
brew "doggo"
brew "gcc"
brew "neovim"
brew "lazygit"
brew "ripgrep"
brew "luarocks"
tap "laishulu/homebrew"
brew "macism"
cask "jetbrains-toolbox"
brew "television"

tap "entireio/tap"
brew "entireio/tap/entire"

# Security
brew "gitleaks"
brew "trufflehog"
brew "git-filter-repo"

# AWS
brew "awscli"
brew "yukiarrr/tap/ecsk"
cask "session-manager-plugin"
cask "aws-vault-binary"

# GCP
cask "gcloud-cli"

# Font
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-udev-gothic-nf"

# IME
tap "daipeihust/tap"
brew "im-select"
cask "google-japanese-ime"

# Browser
cask "thebrowsercompany-dia"

# UI
tap "FelixKratz/formulae"
brew "sketchybar"

# App - Essential
cask "docker-desktop"
cask "espanso"
cask "cmd-eikana"
cask "bitwarden"
cask "raycast"

# App - Work
cask "slack"
cask "notion"
cask "notion-calendar"
cask "discord"

# App - Dev
cask "wezterm@latest"
cask "obsidian"
cask "zed"

# App - AI
cask "chatgpt"
cask "claude"
cask "codex"
cask "claude-code"
brew "copilot-cli"

# App - Other
cask "zoom"
cask "spotify"
