# Git
brew "git"
brew "git-now"
brew "ghq"
brew "difftastic"

# Fish
brew "fish"
brew "fzf"
brew "bat"
brew "fd"
brew "zoxide"

# Dev
brew "asdf"
brew "tmux"
brew "orbstack"
brew "lazydocker"
brew "direnv"
brew "navi"
brew "pipx"
brew "gh"

# AWS
brew "awscli"
brew "yukiarrr/tap/ecsk"
cask session-manager-plugin

# Espanso
tap "espanso/espanso"
brew "espanso"

# Font
tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Browser
cask "firefox@developer-edition"
cask "google-chrome"

# Vim
tap "daipeihust/tap"
brew "im-select"
brew "neovim"

# App - Essential
cask "cmd-eikana"
cask "bitwarden"
cask "raycast"
cask "bartender"

# App - Work
cask "slack"
cask "notion"
cask "notion-calendar"
cask "discord"
cask "akiflow"

# App - Dev
cask "zed"
cask "wezterm"
cask "jetbrains-toolbox"
cask "obsidian"
cask "tablecruncher"

# App - Other
cask "zoom"
cask "spotify"
cask "ticktick"
